ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2351/PeripheralPins.c
const PinMap PinMap_UART_RTS[] = {
    {PA_0, UART_1, SYS_GPA_MFPL_PA0MFP_UART1_nRTS},
    {PA_4, UART_0, SYS_GPA_MFPL_PA4MFP_UART0_nRTS},
    {PB_3, UART_5, SYS_GPB_MFPL_PB3MFP_UART5_nRTS},
    {PB_8, UART_1, SYS_GPB_MFPH_PB8MFP_UART1_nRTS},
    {PB_10, UART_0, SYS_GPB_MFPH_PB10MFP_UART0_nRTS},
    {PB_13, UART_3, SYS_GPB_MFPH_PB13MFP_UART3_nRTS},
    {PB_14, UART_0, SYS_GPB_MFPH_PB14MFP_UART0_nRTS},
    {PC_3, UART_2, SYS_GPC_MFPL_PC3MFP_UART2_nRTS},
    {PC_6, UART_0, SYS_GPC_MFPL_PC6MFP_UART0_nRTS},
    {PD_3, UART_3, SYS_GPD_MFPL_PD3MFP_UART3_nRTS},
    {PD_8, UART_2, SYS_GPD_MFPH_PD8MFP_UART2_nRTS},
    {PE_0, UART_4, SYS_GPE_MFPL_PE0MFP_UART4_nRTS},
    {PE_12, UART_1, SYS_GPE_MFPH_PE12MFP_UART1_nRTS},
    {PE_13, UART_4, SYS_GPE_MFPH_PE13MFP_UART4_nRTS},
    {PF_4, UART_2, SYS_GPF_MFPL_PF4MFP_UART2_nRTS},
    {PH_8, UART_3, SYS_GPH_MFPH_PH8MFP_UART3_nRTS},

    {NC,    NC,     0}
};

const PinMap PinMap_UART_CTS[] = {
    {PA_1, UART_1, SYS_GPA_MFPL_PA1MFP_UART1_nCTS},
    {PA_5, UART_0, SYS_GPA_MFPL_PA5MFP_UART0_nCTS},
    {PB_2, UART_5, SYS_GPB_MFPL_PB2MFP_UART5_nCTS},
    {PB_9, UART_1, SYS_GPB_MFPH_PB9MFP_UART1_nCTS},
    {PB_11, UART_0, SYS_GPB_MFPH_PB11MFP_UART0_nCTS},
    {PB_12, UART_3, SYS_GPB_MFPH_PB12MFP_UART3_nCTS},
    {PB_15, UART_0, SYS_GPB_MFPH_PB15MFP_UART0_nCTS},
    {PC_2, UART_2, SYS_GPC_MFPL_PC2MFP_UART2_nCTS},
    {PC_7, UART_0, SYS_GPC_MFPL_PC7MFP_UART0_nCTS},
    {PC_8, UART_4, SYS_GPC_MFPH_PC8MFP_UART4_nCTS},
    {PD_2, UART_3, SYS_GPD_MFPL_PD2MFP_UART3_nCTS},
    {PD_9, UART_2, SYS_GPD_MFPH_PD9MFP_UART2_nCTS},
    {PE_1, UART_4, SYS_GPE_MFPL_PE1MFP_UART4_nCTS},
    {PE_11, UART_1, SYS_GPE_MFPH_PE11MFP_UART1_nCTS},
    {PF_5, UART_2, SYS_GPF_MFPL_PF5MFP_UART2_nCTS},
    {PH_9, UART_3, SYS_GPH_MFPH_PH9MFP_UART3_nCTS},

    {NC,    NC,     0}
};

//*** SPI ***

const PinMap PinMap_SPI_MOSI[] = {
    {PA_0, SPI_4, SYS_GPA_MFPL_PA0MFP_QSPI0_MOSI0},
    {NU_PINNAME_BIND(PA_0, SPI_4), SPI_4, SYS_GPA_MFPL_PA0MFP_QSPI0_MOSI0},
    {PA_0, SPI_0, SYS_GPA_MFPL_PA0MFP_SPI0_MOSI},
    {NU_PINNAME_BIND(PA_0, SPI_0), SPI_0, SYS_GPA_MFPL_PA0MFP_SPI0_MOSI},
    {PA_8, SPI_2, SYS_GPA_MFPH_PA8MFP_SPI2_MOSI},
    {PA_15, SPI_2, SYS_GPA_MFPH_PA15MFP_SPI2_MOSI},
    {PB_4, SPI_1, SYS_GPB_MFPL_PB4MFP_SPI1_MOSI},
    {PB_8, SPI_3, SYS_GPB_MFPH_PB8MFP_SPI3_MOSI},
    {PB_12, SPI_0, SYS_GPB_MFPH_PB12MFP_SPI0_MOSI},
    {PC_0, SPI_4, SYS_GPC_MFPL_PC0MFP_QSPI0_MOSI0},
    {PC_2, SPI_1, SYS_GPC_MFPL_PC2MFP_SPI1_MOSI},
    {PC_6, SPI_1, SYS_GPC_MFPL_PC6MFP_SPI1_MOSI},
    {PC_11, SPI_3, SYS_GPC_MFPH_PC11MFP_SPI3_MOSI},
    {PD_0, SPI_0, SYS_GPD_MFPL_PD0MFP_SPI0_MOSI},
    {PD_6, SPI_1, SYS_GPD_MFPL_PD6MFP_SPI1_MOSI},
    {PE_0, SPI_4, SYS_GPE_MFPL_PE0MFP_QSPI0_MOSI0},
    {NU_PINNAME_BIND(PE_0, SPI_4), SPI_4, SYS_GPE_MFPL_PE0MFP_QSPI0_MOSI0},
    {PE_0, SPI_1, SYS_GPE_MFPL_PE0MFP_SPI1_MOSI},
    {NU_PINNAME_BIND(PE_0, SPI_1), SPI_1, SYS_GPE_MFPL_PE0MFP_SPI1_MOSI},
    {PE_2, SPI_3, SYS_GPE_MFPL_PE2MFP_SPI3_MOSI},
    {PE_10, SPI_2, SYS_GPE_MFPH_PE10MFP_SPI2_MOSI},
    {PF_6, SPI_0, SYS_GPF_MFPL_PF6MFP_SPI0_MOSI},
    {PF_11, SPI_2, SYS_GPF_MFPH_PF11MFP_SPI2_MOSI},
    {PH_5, SPI_1, SYS_GPH_MFPL_PH5MFP_SPI1_MOSI},

    {NC,    NC,    0}
};

const PinMap PinMap_SPI_MISO[] = {
    {PA_1, SPI_4, SYS_GPA_MFPL_PA1MFP_QSPI0_MISO0},
    {NU_PINNAME_BIND(PA_1, SPI_4), SPI_4, SYS_GPA_MFPL_PA1MFP_QSPI0_MISO0},
    {PA_1, SPI_0, SYS_GPA_MFPL_PA1MFP_SPI0_MISO},
    {NU_PINNAME_BIND(PA_1, SPI_0), SPI_0, SYS_GPA_MFPL_PA1MFP_SPI0_MISO},
    {PA_9, SPI_2, SYS_GPA_MFPH_PA9MFP_SPI2_MISO},
    {PA_14, SPI_2, SYS_GPA_MFPH_PA14MFP_SPI2_MISO},
    {PB_5, SPI_1, SYS_GPB_MFPL_PB5MFP_SPI1_MISO},
    {PB_9, SPI_3, SYS_GPB_MFPH_PB9MFP_SPI3_MISO},
    {PB_13, SPI_0, SYS_GPB_MFPH_PB13MFP_SPI0_MISO},
    {PC_1, SPI_4, SYS_GPC_MFPL_PC1MFP_QSPI0_MISO0},
    {PC_3, SPI_1, SYS_GPC_MFPL_PC3MFP_SPI1_MISO},
    {PC_7, SPI_1, SYS_GPC_MFPL_PC7MFP_SPI1_MISO},
    {PC_12, SPI_3, SYS_GPC_MFPH_PC12MFP_SPI3_MISO},
    {PD_1, SPI_0, SYS_GPD_MFPL_PD1MFP_SPI0_MISO},
    {PD_7, SPI_1, SYS_GPD_MFPL_PD7MFP_SPI1_MISO},
    {PE_1, SPI_4, SYS_GPE_MFPL_PE1MFP_QSPI0_MISO0},
    {NU_PINNAME_BIND(PE_1, SPI_4), SPI_4, SYS_GPE_MFPL_PE1MFP_QSPI0_MISO0},
    {PE_1, SPI_1, SYS_GPE_MFPL_PE1MFP_SPI1_MISO},
    {NU_PINNAME_BIND(PE_1, SPI_1), SPI_1, SYS_GPE_MFPL_PE1MFP_SPI1_MISO},
    {PE_3, SPI_3, SYS_GPE_MFPL_PE3MFP_SPI3_MISO},
    {PE_9, SPI_2, SYS_GPE_MFPH_PE9MFP_SPI2_MISO},
    {PF_7, SPI_0, SYS_GPF_MFPL_PF7MFP_SPI0_MISO},
    {PG_4, SPI_2, SYS_GPG_MFPL_PG4MFP_SPI2_MISO},
    {PH_4, SPI_1, SYS_GPH_MFPL_PH4MFP_SPI1_MISO},

    {NC,    NC,    0}
};

const PinMap PinMap_SPI_SCLK[] = {
    {PA_2, SPI_4, SYS_GPA_MFPL_PA2MFP_QSPI0_CLK},
    {NU_PINNAME_BIND(PA_2, SPI_4), SPI_4, SYS_GPA_MFPL_PA2MFP_QSPI0_CLK},
    {PA_2, SPI_0, SYS_GPA_MFPL_PA2MFP_SPI0_CLK},
    {NU_PINNAME_BIND(PA_2, SPI_0), SPI_0, SYS_GPA_MFPL_PA2MFP_SPI0_CLK},
    {PA_7, SPI_1, SYS_GPA_MFPL_PA7MFP_SPI1_CLK},
    {PA_10, SPI_2, SYS_GPA_MFPH_PA10MFP_SPI2_CLK},
    {PA_13, SPI_2, SYS_GPA_MFPH_PA13MFP_SPI2_CLK},
    {PB_3, SPI_1, SYS_GPB_MFPL_PB3MFP_SPI1_CLK},
    {PB_11, SPI_3, SYS_GPB_MFPH_PB11MFP_SPI3_CLK},
    {PB_14, SPI_0, SYS_GPB_MFPH_PB14MFP_SPI0_CLK},
    {PC_1, SPI_1, SYS_GPC_MFPL_PC1MFP_SPI1_CLK},
    {PC_2, SPI_4, SYS_GPC_MFPL_PC2MFP_QSPI0_CLK},
    {PC_10, SPI_3, SYS_GPC_MFPH_PC10MFP_SPI3_CLK},
    {PD_2, SPI_0, SYS_GPD_MFPL_PD2MFP_SPI0_CLK},
    {PD_5, SPI_1, SYS_GPD_MFPL_PD5MFP_SPI1_CLK},
    {PE_4, SPI_3, SYS_GPE_MFPL_PE4MFP_SPI3_CLK},
    {PE_8, SPI_2, SYS_GPE_MFPH_PE8MFP_SPI2_CLK},
    {PF_2, SPI_4, SYS_GPF_MFPL_PF2MFP_QSPI0_CLK},
    {PF_8, SPI_0, SYS_GPF_MFPH_PF8MFP_SPI0_CLK},
    {PG_3, SPI_2, SYS_GPG_MFPL_PG3MFP_SPI2_CLK},
    {PH_6, SPI_1, SYS_GPH_MFPL_PH6MFP_SPI1_CLK},
    {PH_8, SPI_4, SYS_GPH_MFPH_PH8MFP_QSPI0_CLK},
    {NU_PINNAME_BIND(PH_8, SPI_4), SPI_4, SYS_GPH_MFPH_PH8MFP_QSPI0_CLK},
    {PH_8, SPI_1, SYS_GPH_MFPH_PH8MFP_SPI1_CLK},
    {NU_PINNAME_BIND(PH_8, SPI_1), SPI_1, SYS_GPH_MFPH_PH8MFP_SPI1_CLK},

    {NC,    NC,    0}
};

const PinMap PinMap_SPI_SSEL[] = {
    {PA_3, SPI_4, SYS_GPA_MFPL_PA3MFP_QSPI0_SS},
    {NU_PINNAME_BIND(PA_3, SPI_4), SPI_4, SYS_GPA_MFPL_PA3MFP_QSPI0_SS},
    {PA_3, SPI_0, SYS_GPA_MFPL_PA3MFP_SPI0_SS},
    {NU_PINNAME_BIND(PA_3, SPI_0), SPI_0, SYS_GPA_MFPL_PA3MFP_SPI0_SS},
    {PA_6, SPI_1, SYS_GPA_MFPL_PA6MFP_SPI1_SS},
    {PA_11, SPI_2, SYS_GPA_MFPH_PA11MFP_SPI2_SS},
    {PA_12, SPI_2, SYS_GPA_MFPH_PA12MFP_SPI2_SS},
    {PB_2, SPI_1, SYS_GPB_MFPL_PB2MFP_SPI1_SS},
    {PB_10, SPI_3, SYS_GPB_MFPH_PB10MFP_SPI3_SS},
    {PB_15, SPI_0, SYS_GPB_MFPH_PB15MFP_SPI0_SS},
    {PC_0, SPI_1, SYS_GPC_MFPL_PC0MFP_SPI1_SS},
    {PC_3, SPI_4, SYS_GPC_MFPL_PC3MFP_QSPI0_SS},
    {PC_9, SPI_3, SYS_GPC_MFPH_PC9MFP_SPI3_SS},
    {PD_3, SPI_0, SYS_GPD_MFPL_PD3MFP_SPI0_SS},
    {PD_4, SPI_1, SYS_GPD_MFPL_PD4MFP_SPI1_SS},
    {PE_5, SPI_3, SYS_GPE_MFPL_PE5MFP_SPI3_SS},
    {PE_11, SPI_2, SYS_GPE_MFPH_PE11MFP_SPI2_SS},
    {PF_9, SPI_0, SYS_GPF_MFPH_PF9MFP_SPI0_SS},
    {PG_2, SPI_2, SYS_GPG_MFPL_PG2MFP_SPI2_SS},
    {PH_7, SPI_1, SYS_GPH_MFPL_PH7MFP_SPI1_SS},
    {PH_9, SPI_4, SYS_GPH_MFPH_PH9MFP_QSPI0_SS},
    {NU_PINNAME_BIND(PH_9, SPI_4), SPI_4, SYS_GPH_MFPH_PH9MFP_QSPI0_SS},
    {PH_9, SPI_1, SYS_GPH_MFPH_PH9MFP_SPI1_SS},
    {NU_PINNAME_BIND(PH_9, SPI_1), SPI_1, SYS_GPH_MFPH_PH9MFP_SPI1_SS},

    {NC,    NC,    0}
};

//*** SD ***

const PinMap PinMap_SD_DAT0[] = {
    {PB_2, SD_0, SYS_GPB_MFPL_PB2MFP_SD0_DAT0},
    {PE_2, SD_0, SYS_GPE_MFPL_PE2MFP_SD0_DAT0},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT1[] = {
    {PB_3, SD_0, SYS_GPB_MFPL_PB3MFP_SD0_DAT1},
    {PE_3, SD_0, SYS_GPE_MFPL_PE3MFP_SD0_DAT1},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT2[] = {
    {PB_4, SD_0, SYS_GPB_MFPL_PB4MFP_SD0_DAT2},
    {PE_4, SD_0, SYS_GPE_MFPL_PE4MFP_SD0_DAT2},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT3[] = {
    {PB_5, SD_0, SYS_GPB_MFPL_PB5MFP_SD0_DAT3},
    {PE_5, SD_0, SYS_GPE_MFPL_PE5MFP_SD0_DAT3},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_CMD[] = {
    {PB_0, SD_0, SYS_GPB_MFPL_PB0MFP_SD0_CMD},
    {PE_7, SD_0, SYS_GPE_MFPL_PE7MFP_SD0_CMD},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_CLK[] = {
    {PB_1, SD_0, SYS_GPB_MFPL_PB1MFP_SD0_CLK},
    {PE_6, SD_0, SYS_GPE_MFPL_PE6MFP_SD0_CLK},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_CD[] = {
    {PB_12, SD_0, SYS_GPB_MFPH_PB12MFP_SD0_nCD},
    {PD_13, SD_0, SYS_GPD_MFPH_PD13MFP_SD0_nCD},

    {NC,    NC,    0}
};

const PinMap PinMap_CAN_TD[] = {
    {PA_5, CAN_0, SYS_GPA_MFPL_PA5MFP_CAN0_TXD},
    {PA_12, CAN_0, SYS_GPA_MFPH_PA12MFP_CAN0_TXD},
    {PB_11, CAN_0, SYS_GPB_MFPH_PB11MFP_CAN0_TXD},
    {PC_5, CAN_0, SYS_GPC_MFPL_PC5MFP_CAN0_TXD},
    {PD_11, CAN_0, SYS_GPD_MFPH_PD11MFP_CAN0_TXD},
    {PE_14, CAN_0, SYS_GPE_MFPH_PE14MFP_CAN0_TXD},

    {NC,    NC,     0}
};

const PinMap PinMap_CAN_RD[] = { 
    {PA_4, CAN_0, SYS_GPA_MFPL_PA4MFP_CAN0_RXD},
    {PA_13, CAN_0, SYS_GPA_MFPH_PA13MFP_CAN0_RXD},
    {PB_10, CAN_0, SYS_GPB_MFPH_PB10MFP_CAN0_RXD},
    {PC_4, CAN_0, SYS_GPC_MFPL_PC4MFP_CAN0_RXD},
    {PD_10, CAN_0, SYS_GPD_MFPH_PD10MFP_CAN0_RXD},
    {PE_15, CAN_0, SYS_GPE_MFPH_PE15MFP_CAN0_RXD},

    {NC,    NC,    0}
};
